{'LabelNo': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4, 5: 5, 6: 6, 7: 7, 8: 8, 9: 9, 10: 10, 11: 11, 12: 12, 13: 13, 14: 14, 15: 15, 16: 16, 17: 17, 18: 18, 19: 19, 20: 20, 21: 21, 22: 22, 23: 22, 24: 24}, 'HuntName': {0: 'Oregon Maple', 1: 'California buckeye', 2: 'Showy milkweed', 3: 'Incense cedar', 4: 'Great red paintbrush', 5: 'Pacific dogwood', 6: 'Common Raven', 7: 'Californian Poppy', 8: 'Western juniper', 9: 'Black tailed Deer', 10: 'Whitebark pine', 11: 'Narrowcone pine', 12: 'Prickly ponderosa', 13: 'Grey leaf pine', 14: 'Douglas Fir', 15: 'California black oak', 16: 'Valley oak', 17: 'Snowplant', 18: 'Pacific Blue bellied Lizard', 19: 'Giant Redwood', 20: 'California nutmeg', 21: 'Western poison oak', 22: 'Myrtlewood', 23: 'American Aspen', 24: 'Not Recognized'}, 'Landmark?': {0: 0, 1: 0, 2: 0, 3: 0, 4: 0, 5: 0, 6: 0, 7: 0, 8: 0, 9: 0, 10: 0, 11: 0, 12: 0, 13: 0, 14: 0, 15: 0, 16: 0, 17: 0, 18: 0, 19: 0, 20: 0, 21: 0, 22: 0, 23: 0, 24: 0}, 'ItemClass': {0: 'Magnoliopsida', 1: 'Magnoliopsida', 2: 'Magnoliopsida', 3: 'Pinopsida', 4: 'Magnoliopsida', 5: 'Magnoliopsida', 6: 'Aves', 7: 'Magnoliopsida', 8: 'Pinopsida', 9: 'Mammalia', 10: 'Pinopsida', 11: 'Pinopsida', 12: 'Pinopsida', 13: 'Pinopsida', 14: 'Pinopsida', 15: 'Magnoliopsida', 16: 'Magnoliopsida', 17: 'Magnoliopsida', 18: 'Reptilia', 19: 'Pinopsida', 20: 'Pinopsida', 21: 'Magnoliopsida', 22: 'Magnoliopsida', 23: 'Magnoliopsida', 24: nan}, 'Genus': {0: 'Acer', 1: 'Aesculus', 2: 'Asclepias', 3: 'Calocedrus', 4: 'Castilleja', 5: 'Cornus', 6: 'Corvus', 7: 'Eschscholzia', 8: 'Juniperus', 9: 'Odocoileus', 10: 'Pinus', 11: 'Pinus', 12: 'Pinus', 13: 'Pinus', 14: 'Pseudotsuga', 15: 'Quercus', 16: 'Quercus', 17: 'Sarcodes', 18: 'Sceloporus', 19: 'Sequoiadendron', 20: 'Torreya', 21: 'Toxicodendron', 22: 'Umbellularia', 23: 'Populus', 24: nan}, 'Species': {0: 'macrophyllum', 1: 'californica', 2: 'speciosa', 3: 'decurrens', 4: 'miniata', 5: 'nuttallii', 6: 'corax', 7: 'californica', 8: 'occidentalis', 9: 'hemionus', 10: 'albicaulis', 11: 'attenuata', 12: 'ponderosa', 13: 'sabiniana', 14: 'menziesii', 15: 'kelloggii', 16: 'lobata', 17: 'sanguinea', 18: 'occidentalis', 19: 'giganteum', 20: 'californica', 21: 'diversilobum', 22: 'californica', 23: 'tremuloides', 24: nan}, 'Description': {0: 'This is the largest tree of all the maple species. Natives historically harvested bigleaf maple branches and twigs. They used its bark for making rope, the wood for utensils and canoe paddles, and the shoots for baskets.', 1: 'Young buckeye shoots were sometimes used as spindles or twirling sticks in fire-making kits. Many tribes mashed buckeye\xa0nuts\xa0and poured the contents into quiet pools to stupefy or kill fish.', 2: 'The sap of showy milkweed was used by some desert tribes to heal sores and cuts, and to cure warts and ringworm. Tea made from the rhizomes was a remedy for measles or coughs.', 3: 'Cedar is one of the most important Native American ceremonial plants, used by many tribes as an incense and purifying herb. Cedar is especially associated with prayer, healing, dreams, and protection against disease.', 4: 'The flowers of Indian paintbrush are edible, and were consumed in moderation by various Native American tribes as a condiment with other fresh greens. Indian paintbrush has similar health benefits to consuming garlic if only the flowers are eaten in small amounts.', 5: 'Natives used the hard, dried wood for harpoon shafts and other implements.  It is known to soothe a stomach ache. The wood has also been used to make thread spindles, golf club heads and piano keys.', 6: 'Known as the transformer of worlds and a selfish trickster in northwest coastal native cultures.\xa0Ravens have among the largest brains of any bird. They have a high aptitude for problem solving and play, and are one of few species to make their own toys.', 7: 'Aside from being the CA state flower, in combination with other herbs, California poppy is used for depression, long-term mental and physical tiredness (neurasthenia), nerve pain, various psychiatric conditions, blood vessel problems, sensitivity to weather changes, and sedation.', 8: 'Its crushed bark was sometimes twisted into a\xa0rope, and tied at intervals with yucca  and wrapped into a\xa0coil. The free end was set on fire and kept smouldering by blowing on it at intervals. Fire could be carried in this fashion for several hours.', 9: 'Since about 12,000 BCE these animals have been hunted by CA indigenous peoples. They used the deer skin for clothing and bones for tools.', 10: 'It is a valuable remedy used internally in the treatment of kidney and bladder complaints and is used both internally and as a rub and steam bath in the treatment of rheumatic pain.', 11: 'It is a valuable remedy used internally in the treatment of kidney and bladder complaints and is used both internally and as a rub and steam bath in the treatment of rheumatic pain.', 12: 'Roots of ponderosa pine were used to make blue dye and needles were used as insulation for underground storage pits. Bark was used to cover houses.', 13: 'It has limited commercial use today, but it once was important to California Indians, who used its seeds and parts of cones, bark, and buds as food supplements, and its twigs, needles, cones, and resin in basket and drum construction.', 14: 'It is used as a poultice to treat cuts, burns, wounds and\xa0other\xa0skin ailments. The poultice is also used to treat injured or dislocated bones. The resin is used in the treatment of coughs and sore throats.', 15: 'Some California Native Americans preferred California black oak acorns over those of other species for making acorn meal. This acorn was a staple food for many Native American groups, comprising up to 60% of their diet.', 16: 'Native Americans used valley oak acorns for making meal.  During the\nlast century, domestic pigs were driven to Central Valley oak woodlands for mast feedings.', 17: 'The snow plant’s scientific name, sarcodes sanguinea , roughly translates to “the bloody flesh-like thing.” The snow plant does not need the sun to survive. \nIt derives its nutrients from fungi in the soil.', 18: 'They can change color from light grey or tan to nearly jet black, but they probably use this ability for the purpose of thermoregulation', 19: 'These ancient trees are the most massive and among the oldest of any living thing on Earth. This is particularly interesting because their pinecones are only 2" long!', 20: 'The seeds were a highly esteemed food of California Indians.  In\naddition, Indians used the tree roots for making baskets, and the\nwood for making bows.', 21: "While this plant is most known for giving humans a rash, it is also the most important black-tailed deer browse. It also feeds several types of birds, so it's not all bad!", 22: 'Although the aroma of the leaves is known to cause headaches, they have also been used as an infusion and a poultice to treat this affliction. The leaves are also used internally to treat neuralgia, intestinal cramps and gastro-enteritis.', 23: 'American\xa0aspen\xa0has a long history of herbal\xa0use. It was widely employed medicinally by many native North American Indian tribes who valued it especially for its antiseptic and analgesic qualities,\xa0using\xa0it in the treatment of wounds, skin complaints and respiratory disorders.', 24: nan}, 'Hints': {0: "If you're not in time to see this trees large yellow leaves, perhaps you can spot one by its multiple trunks.", 1: 'A deciduous, small tree, normally growing to 15\'. The showy 6" creamy- scented flower spikes appear in April-May.', 2: 'Look in pastures, meadows, forest clearings, untilled fields, roadsides, and ditch banks.', 3: 'Often confused with the sequoia, use your senses to help "sniff out" this conifer.', 4: 'This parasitic plant grows up to 2.5 feet tall, and is bright red due to its lack of photosynthesis.', 5: 'Pacific dogwood grows best on well-drained soils, often underneath Douglas-fir.', 6: "I'm all around the campsites looking for food you left behind.", 7: 'Look for the lively orange, red and yellow in this iconic California flower.', 8: 'The back of each needle has a white or clear resin dot.', 9: 'Look in the brush for this grazing beauty', 10: 'This hardy pine can be found in windier and colder spots than other species.', 11: 'Found on dry, rocky slopes and ridges\xa0.', 12: 'This pine has a particularly prickly pinecone which gives it its nickname "Prickly Ponderosa"', 13: 'This five needled pine has long cylindrical cones.', 14: 'The cone has unique snake-tongue-like forks creeping out from under the scales.', 15: 'The inner bark is bright yellow or yellow orange, distinguishing it from the other oaks, whose inner bark is more bland.', 16: 'A fast growing shade tree, these oaks can grow to 70` tall.', 17: 'This plant relies on the conifers to exist, so look around the tree line for its distinct red appearance.', 18: "If you're quiet enough, you might sneak up on me while I'm sunbathing on a rock.", 19: 'Look to the sky to identify these towering giants.', 20: 'Small, inconspicuous flowers appear each year in spring and early summer, although fruit production is very erratic and unreliable.', 21: "This plant will have you reaching for the calamine lotion if you're not careful. It's also a seasonal chameleon, frequently changing its hues of green, yellow and red.", 22: 'Crush and smell a leaf to see if it has a peppery aroma.', 23: 'The bark on young trees is thin, pale-green to creamy white; on older trees it becomes thick, roughened by warty bands, and divided into flattened ridges.', 24: nan}, 'MinAltitude': {0: 2500, 1: 1500, 2: 0, 3: 160, 4: 5000, 5: 4000, 6: 0, 7: 0, 8: 0, 9: 2000, 10: 7500, 11: 2600, 12: 4000, 13: 0, 14: 0, 15: 1000, 16: 0, 17: 4000, 18: 0, 19: 3000, 20: 1000, 21: 0, 22: 0, 23: 5000, 24: -1000}, 'MaxAltitude': {0: 5500, 1: 5000, 2: 6200, 3: 9510, 4: 15000, 5: 6000, 6: 15000, 7: 6500, 8: 10000, 9: 10000, 10: 11000, 11: 4500, 12: 9000, 13: 4000, 14: 5900, 15: 7000, 16: 5600, 17: 9000, 18: 8800, 19: 7100, 20: 6000, 21: 5000, 22: 5500, 23: 12000, 24: -999}, 'Abundance': {0: 'Common', 1: 'Uncommon', 2: 'Common', 3: 'Abundant', 4: 'Common', 5: 'Common', 6: 'Abundant', 7: 'Uncommon', 8: 'Common', 9: 'Common', 10: 'Common', 11: 'Uncommon', 12: 'Abundant', 13: 'Common', 14: 'Abundant', 15: 'Common', 16: 'Uncommon', 17: 'Common', 18: 'Common', 19: 'Common', 20: 'Uncommon', 21: 'Uncommon', 22: 'Uncommon', 23: 'Common', 24: nan}, 'RarityScore': {0: 5.0, 1: 7.0, 2: 5.0, 3: 1.0, 4: 5.0, 5: 5.0, 6: 1.0, 7: 7.0, 8: 5.0, 9: 5.0, 10: 5.0, 11: 7.0, 12: 1.0, 13: 5.0, 14: 1.0, 15: 5.0, 16: 7.0, 17: 5.0, 18: 5.0, 19: 5.0, 20: 7.0, 21: 7.0, 22: 7.0, 23: 5.0, 24: nan}, 'DifficultyLevel': {0: 'Med', 1: 'Med', 2: 'Med', 3: 'Easy', 4: 'Med', 5: 'Med', 6: 'Easy', 7: 'Med', 8: 'Med', 9: 'Med', 10: 'Med', 11: 'Med', 12: 'Easy', 13: 'Med', 14: 'Easy', 15: 'Med', 16: 'Med', 17: 'Med', 18: 'Med', 19: 'Med', 20: 'Med', 21: 'Med', 22: 'Med', 23: 'Med', 24: nan}, 'Endemic?': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 0.0, 7: 1.0, 8: 1.0, 9: 1.0, 10: 1.0, 11: 1.0, 12: 1.0, 13: 1.0, 14: 1.0, 15: 1.0, 16: 1.0, 17: 1.0, 18: 1.0, 19: 1.0, 20: 1.0, 21: 1.0, 22: 1.0, 23: 1.0, 24: nan}, 'Scavenger?': {0: 0.0, 1: 0.0, 2: 0.0, 3: 0.0, 4: 0.0, 5: 0.0, 6: 1.0, 7: 0.0, 8: 0.0, 9: 0.0, 10: 0.0, 11: 0.0, 12: 0.0, 13: 0.0, 14: 0.0, 15: 0.0, 16: 0.0, 17: 0.0, 18: 1.0, 19: 0.0, 20: 0.0, 21: 0.0, 22: 0.0, 23: 0.0, 24: nan}, 'Predator?': {0: 0.0, 1: 0.0, 2: 0.0, 3: 0.0, 4: 0.0, 5: 0.0, 6: 1.0, 7: 0.0, 8: 0.0, 9: 0.0, 10: 0.0, 11: 0.0, 12: 0.0, 13: 0.0, 14: 0.0, 15: 0.0, 16: 0.0, 17: 0.0, 18: 1.0, 19: 0.0, 20: 0.0, 21: 0.0, 22: 0.0, 23: 0.0, 24: nan}, 'Decomposer?': {0: 0.0, 1: 0.0, 2: 0.0, 3: 0.0, 4: 0.0, 5: 0.0, 6: 0.0, 7: 0.0, 8: 0.0, 9: 0.0, 10: 0.0, 11: 0.0, 12: 0.0, 13: 0.0, 14: 0.0, 15: 0.0, 16: 0.0, 17: 0.0, 18: 0.0, 19: 0.0, 20: 0.0, 21: 0.0, 22: 0.0, 23: 0.0, 24: nan}, 'CarbonHungry?': {0: 1.0, 1: 1.0, 2: 0.0, 3: 0.0, 4: 0.0, 5: 1.0, 6: 0.0, 7: 0.0, 8: 0.0, 9: 0.0, 10: 0.0, 11: 0.0, 12: 0.0, 13: 0.0, 14: 0.0, 15: 1.0, 16: 1.0, 17: 0.0, 18: 0.0, 19: 0.0, 20: 0.0, 21: 0.0, 22: 1.0, 23: 0.0, 24: nan}, 'Flowering?': {0: 1.0, 1: 1.0, 2: 1.0, 3: 0.0, 4: 1.0, 5: 1.0, 6: 0.0, 7: 1.0, 8: 0.0, 9: 0.0, 10: 0.0, 11: 0.0, 12: 0.0, 13: 0.0, 14: 1.0, 15: 1.0, 16: 1.0, 17: 1.0, 18: 0.0, 19: 1.0, 20: 1.0, 21: 1.0, 22: 1.0, 23: 1.0, 24: nan}}